src/gatling/resources/data/token_0018_request.txt

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"><s:Body><ExecuteAuthnRequest xmlns="http://www.wizards.com/Service/2013-03"><requestMessage xmlns:i="http://www.w3.org/2001/XMLSchema-instance">&lt;samlp:AuthnRequest  xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" ID="_4ed957f1-88bf-44e3-35f9-454d535fa420" Version="2.0" IssueInstant="2019-06-19T22:21:00Z" xmlns="urn:oasis:names:tc:SAML:2.0:protocol"&gt;&lt;saml:Issuer AllowCreate="false" SPNameQualifier="webr20accounts.wizards.com" Format="urn:oasis:names:tc:SAML:2.0:nameidformat:entity" xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/&gt;&lt;samlp:Extensions&gt;&lt;Credentials UserName="VivTest" Password="3ac8a118256004910743dfbdf28451d651475e57f0fa5fffeb0099ec0ac5674a" RememberMe="false"   xmlns="##other" /&gt;&lt;/samlp:Extensions&gt;&lt;/samlp:AuthnRequest&gt;</requestMessage></ExecuteAuthnRequest></s:Body></s:Envelope>